Revit 2027 API
CurtainGrid.GetVGridLineIds Method
 Gets all ElementIds of grid lines in the V direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetVGridLineIds()
Public Function GetVGridLineIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetVGridLineIds()
member GetVGridLineIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The V grid line ElementIds
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace